Repository: Tudor-Anitas/MyCreditLoans
Catalog: lib/l10n/app_*.arb
Languages: ro

source: Welcome
ro: Bine ai venit

# loanHeadline
source: Please select the desired loan
ro: Alege imprumutul dorit

# loanPeriod
source: The period of time for the loan
ro: Perioada de timp pentru imprumut

# oneMonth
source: 1 month
ro: o luna

# threeMonths
source: 3 months
ro: 3 luni

# sixMonths
source: 6 months
ro: 6 luni

# oneYear
source: 1 year
ro: 1 an

# cancelBtn
source: Cancel
ro: Inapoi

# continueBtn
source: Continue
ro: Continua

# interestHeadline
source: The applied interest is 1%
ro: Dobanda aplicata este de 1%

# loanSelected
source: The loan selected is:
ro: Imprumutul selectat este:

# paymentEveryMonth
source: , the payment for every month will be
ro: , iar rata lunara este de

# paymentHeadline
source: Payment per month
ro: Rata pe luna

source: Period of time
ro: Perioada de timp

source: months
ro: luni

# formHeadline
source: Please complete the form to continue
ro: Completeaza formularul pentru a continua

# nameHint
source: First and last name
ro: Prenume si nume

source: Employed
ro: Angajat

source: Unemployed
ro: Somer

# jobHint
source: Job title
ro: Titlul jobului

source: Monthly income
ro: Venit lunar

# addPhoto
source: Please add a photo with your last bill
ro: Adauga o poza cu ultima factura

# applicationHeader
source: Your application was
ro: Cererea dumneavoastra a fost

# applicationResultValid
source: successful
ro: cu succes

# applicationResultInvalid
source: unsuccessful
ro: fara succes

# creditScoreHeader
source: Your credit score is
ro: Scorul creditului dumneavoastra este

# finishBtn
source: Finish
ro: Gata

# snackBarInvalidInput
source: Please fill all the fields!
ro: Completeaza toate campurile inainte!

# snackBarHttpError
source: A problem occurred with your request! Try again later
ro: A apărut o problemă cu solicitarea dvs.! Incercati mai tarziu
